Repository: Taritsyn/JavaScriptEngineSwitcher
Catalog: src/JavaScriptEngineSwitcher.ChakraCore/Resources/Strings.*.resx
Languages: ru_ru

# Engines_AddingDirectoryToDllSearchPathFailed
source: Failed to add the '{0}' directory to the search path used to locate DLLs for the application.
ru_ru: Не удалось добавить "{0}" директорию к пути поиска, используемому для определения местонахождения DLL!

# Engines_ChakraCoreAssemblyDirectoryNotFound
source: The '{0}' directory, that should contain `ChakraCore.dll` assembly, does not exist.
ru_ru: Директория "{0}", в которой должна находится сборка `ChakraCore.dll`, не существует!

# Runtime_HostDelegateInvocationFailed
source: During invocation of the host delegate an error has occurred - “{0}”.
ru_ru: Во время вызова делегата хоста произошла ошибка - «{0}»!

# Runtime_HostObjectFieldGettingFailed
source: During getting value of '{0}' field of the host object an error has occurred - “{1}”.
ru_ru: Во время получения значения поля "{0}" объекта хоста произошла ошибка - «{1}»!

# Runtime_HostObjectFieldSettingFailed
source: During setting value of '{0}' field of the host object an error has occurred - “{1}”.
ru_ru: Во время присваивания значения полю "{0}" объекта хоста произошла ошибка - «{1}»!

# Runtime_HostObjectMethodInvocationFailed
source: During invocation of '{0}' method of the host object an error has occurred - “{1}”.
ru_ru: Во время вызова метода "{0}" объекта хоста произошла ошибка - «{1}»!

# Runtime_HostObjectPropertyGettingFailed
source: During getting value of '{0}' property of the host object an error has occurred - “{1}”.
ru_ru: Во время получения значения свойства "{0}" объекта хоста произошла ошибка - «{1}»!

# Runtime_HostObjectPropertySettingFailed
source: During setting value of '{0}' property of the host object an error has occurred - “{1}”.
ru_ru: Во время присваивания значения свойству "{0}" объекта хоста произошла ошибка - «{1}»!

# Runtime_HostTypeConstructorInvocationFailed
source: During invocation of constructor of the `{0}` host type an error has occurred - “{1}”.
ru_ru: Во время вызова конструктора типа хоста `{0}` произошла ошибка - «{1}»!

# Runtime_HostTypeConstructorNotFound
source: Could not create instance of the `{0}` host type, because it does not have any public constructor.
ru_ru: Не удается создать экземпляр типа хоста `{0}`, потому что он не имеет ни одного публичного конструктора!

# Runtime_HostTypeFieldGettingFailed
source: During getting value of '{0}' field of the `{1}` host type an error has occurred - “{2}”.
ru_ru: Во время получения значения поля "{0}" типа хоста `{1}` произошла ошибка - «{2}»!

# Runtime_HostTypeFieldSettingFailed
source: During setting value of '{0}' field of the `{1}` host type an error has occurred - “{2}”.
ru_ru: Во время присваивания значения полю "{0}" типа хоста `{1}` произошла ошибка - «{2}»!

# Runtime_HostTypeMethodInvocationFailed
source: During invocation of '{0}' method of the `{1}` host type an error has occurred - “{2}”.
ru_ru: Во время вызова метода "{0}" типа хоста `{1}` произошла ошибка - «{2}»!

# Runtime_HostTypePropertyGettingFailed
source: During getting value of '{0}' property of the `{1}` host type an error has occurred - “{2}”.
ru_ru: Во время получения значения свойства "{0}" типа хоста `{1}` произошла ошибка - «{2}»!

# Runtime_HostTypePropertySettingFailed
source: During setting value of '{0}' property of the host type `{1}` an error has occurred - “{2}”.
ru_ru: Во время присваивания значения свойству "{0}" типа хоста `{1}` произошла ошибка - «{2}»!

# Runtime_InvalidThisContextForHostObjectField
source: Could not retrieve field '{0}' of the host object, because there was an invalid `this` context.
ru_ru: Не удалось получить поле "{0}" объекта хоста, потому что контекст `this` недействителен!

# Runtime_InvalidThisContextForHostObjectMethod
source: Could not call method '{0}' of the host object, because there was an invalid `this` context.
ru_ru: Не удалось вызвать метод "{0}" объекта хоста, потому что контекст `this` недействителен!

# Runtime_InvalidThisContextForHostObjectProperty
source: Could not retrieve property '{0}' of the host object, because there was an invalid `this` context.
ru_ru: Не удалось получить свойство "{0}" объекта хоста, потому что контекст `this` недействителен!

# Runtime_SuitableConstructorOfHostTypeNotFound
source: Could not find suitable constructor or not enough arguments to invoke of constructor of the `{0}` host type.
ru_ru: Не получается найти подходящий конструктор или не хватает аргументов для вызова конструктора `{0}` типа хоста!

# Runtime_SuitableMethodOfHostObjectNotFound
source: Could not find suitable method or not enough arguments to invoke of '{0}' method of the host object.
ru_ru: Не получается найти подходящий метод или не хватает аргументов для вызова метода "{0}" объекта хоста!
